In [13]:
import pandas as pd

In [14]:
import numpy as np

In [12]:
import matplotlib.pyplot as plt

In [15]:
s = pd.Series([1,3,5,np.nan,6,8])

In [17]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [19]:
dates = pd.date_range('20130101', periods=6)

In [20]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [22]:
df

                   A         B         C         D
2013-01-01 -0.786636 -0.479564 -0.998636  0.565433
2013-01-02  0.927643  0.461510 -1.340837  1.277411
2013-01-03 -1.223888 -0.446595 -2.148374 -0.989698
2013-01-04  0.424970  2.481602  0.325875  0.315805
2013-01-05 -1.038960 -0.531768  1.636722  0.311319
2013-01-06 -0.403379 -1.176925  1.185527  2.613864

In [24]:
df2 = pd.DataFrame({
    'A' : 1.,
    'B' : pd.Timestamp('20130102'),
    'C' : pd.Series(1,index=list(range(4)), dtype='float32'),
    'D' : np.array([3] * 4,dtype='int32'),
    'E' : pd.Categorical(["test", "train", "test", "train"]),
    'F' : 'foo'
})

In [25]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [26]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [30]:
df2.head(2)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo

In [31]:
df2.tail(2)

     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [32]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [33]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [34]:
df.values

array([[-0.78663598, -0.47956364, -0.99863638,  0.56543345],
       [ 0.9276431 ,  0.46151001, -1.34083749,  1.27741068],
       [-1.2238876 , -0.44659471, -2.14837416, -0.98969771],
       [ 0.42496987,  2.48160175,  0.32587544,  0.31580467],
       [-1.03896048, -0.53176761,  1.63672224,  0.31131891],
       [-0.40337934, -1.17692496,  1.18552678,  2.61386431]])

In [35]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.350042  0.051377 -0.223287  0.682356
std    0.856130  1.300220  1.503464  1.197186
min   -1.223888 -1.176925 -2.148374 -0.989698
25%   -0.975879 -0.518717 -1.255287  0.312440
50%   -0.595008 -0.463079 -0.336380  0.440619
75%    0.217883  0.234484  0.970614  1.099416
max    0.927643  2.481602  1.636722  2.613864

In [38]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.786636    0.927643   -1.223888    0.424970   -1.038960   -0.403379
B   -0.479564    0.461510   -0.446595    2.481602   -0.531768   -1.176925
C   -0.998636   -1.340837   -2.148374    0.325875    1.636722    1.185527
D    0.565433    1.277411   -0.989698    0.315805    0.311319    2.613864

In [39]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.565433 -0.998636 -0.479564 -0.786636
2013-01-02  1.277411 -1.340837  0.461510  0.927643
2013-01-03 -0.989698 -2.148374 -0.446595 -1.223888
2013-01-04  0.315805  0.325875  2.481602  0.424970
2013-01-05  0.311319  1.636722 -0.531768 -1.038960
2013-01-06  2.613864  1.185527 -1.176925 -0.403379

In [40]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06 -0.403379 -1.176925  1.185527  2.613864
2013-01-05 -1.038960 -0.531768  1.636722  0.311319
2013-01-01 -0.786636 -0.479564 -0.998636  0.565433
2013-01-03 -1.223888 -0.446595 -2.148374 -0.989698
2013-01-02  0.927643  0.461510 -1.340837  1.277411
2013-01-04  0.424970  2.481602  0.325875  0.315805

In [45]:
df[2:3]

                   A         B         C         D
2013-01-03 -1.223888 -0.446595 -2.148374 -0.989698

In [46]:
df.loc[dates[0]]

A   -0.786636
B   -0.479564
C   -0.998636
D    0.565433
Name: 2013-01-01 00:00:00, dtype: float64

In [47]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.927643  0.461510 -1.340837  1.277411
2013-01-04  0.424970  2.481602  0.325875  0.315805

In [48]:
df2 = df.copy()

In [50]:
df2['E'] = ['one', 'one','two','three','four','three']

In [51]:
df2

                   A         B         C         D      E
2013-01-01 -0.786636 -0.479564 -0.998636  0.565433    one
2013-01-02  0.927643  0.461510 -1.340837  1.277411    one
2013-01-03 -1.223888 -0.446595 -2.148374 -0.989698    two
2013-01-04  0.424970  2.481602  0.325875  0.315805  three
2013-01-05 -1.038960 -0.531768  1.636722  0.311319   four
2013-01-06 -0.403379 -1.176925  1.185527  2.613864  three

In [52]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -1.223888 -0.446595 -2.148374 -0.989698   two
2013-01-05 -1.038960 -0.531768  1.636722  0.311319  four

In [53]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [54]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [55]:
df['F'] = s1

In [56]:
df

                   A         B         C         D    F
2013-01-01 -0.786636 -0.479564 -0.998636  0.565433  NaN
2013-01-02  0.927643  0.461510 -1.340837  1.277411  1.0
2013-01-03 -1.223888 -0.446595 -2.148374 -0.989698  2.0
2013-01-04  0.424970  2.481602  0.325875  0.315805  3.0
2013-01-05 -1.038960 -0.531768  1.636722  0.311319  4.0
2013-01-06 -0.403379 -1.176925  1.185527  2.613864  5.0

In [57]:
s = pd.Series(np.random.randint(0,7,size=10))

In [58]:
s

0    5
1    3
2    6
3    1
4    1
5    5
6    5
7    2
8    4
9    5
dtype: int64

In [59]:
s.value_counts()

5    4
1    2
6    1
4    1
3    1
2    1
dtype: int64

## Time Series

In [66]:
rng = pd.date_range('3/6/2012', periods=100, freq='S')

In [72]:
ts = pd.Series(np.random.randint(0,500, len(rng)), index=rng)

In [73]:
ts.resample('5Min').sum()

2012-03-06    22785
Freq: 5T, dtype: int64

In [74]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [75]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [76]:
ts

2012-03-06    0.328773
2012-03-07   -0.991512
2012-03-08   -0.021122
2012-03-09   -0.104548
2012-03-10    0.395510
Freq: D, dtype: float64

In [77]:
ts_utc = ts.tz_localize('UTC')

In [78]:
ts_utc

2012-03-06 00:00:00+00:00    0.328773
2012-03-07 00:00:00+00:00   -0.991512
2012-03-08 00:00:00+00:00   -0.021122
2012-03-09 00:00:00+00:00   -0.104548
2012-03-10 00:00:00+00:00    0.395510
Freq: D, dtype: float64

In [86]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    0.328773
2012-03-06 19:00:00-05:00   -0.991512
2012-03-07 19:00:00-05:00   -0.021122
2012-03-08 19:00:00-05:00   -0.104548
2012-03-09 19:00:00-05:00    0.395510
Freq: D, dtype: float64

In [87]:
ts_utc.tz_convert('Europe/Oslo')

2012-03-06 01:00:00+01:00    0.328773
2012-03-07 01:00:00+01:00   -0.991512
2012-03-08 01:00:00+01:00   -0.021122
2012-03-09 01:00:00+01:00   -0.104548
2012-03-10 01:00:00+01:00    0.395510
Freq: D, dtype: float64

# Plotting

In [93]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))

In [95]:
ts = ts.cumsum()